Repository: Lean365/Takt.Net
Catalog: backend/src/Takt.Infrastructure/Resources/EmailResources.*.resx
Languages: ar_sa, fr_fr, ja_jp, ko_kr, ru_ru, zh_cn, zh_tw

# Common_Greeting
source: Dear {0}({1}):
ar_sa: عزيزي {0}({1}):
fr_fr: Cher {0}({1}) :
ja_jp: 拝啓 {0}({1})：
ko_kr: 존경하는 {0}({1}) 님:
ru_ru: Уважаемый(ая) {0}({1}):
zh_cn: 尊敬的 {0}({1})：
zh_tw: 尊敬的 {0}({1})：

# Common_Date
source: Date:
ar_sa: التاريخ:
ja_jp: 日付：
ko_kr: 날짜:
ru_ru: Дата:
zh_cn: 日期：
zh_tw: 日期：

# Common_Footer
source: This is an automated message. Please do not reply.
ar_sa: هذه رسالة آلية. يرجى عدم الرد.
fr_fr: Ceci est un message automatique. Veuillez ne pas répondre.
ja_jp: これは自動送信メールです。返信しないでください。
ko_kr: 자동 발송 메일입니다. 회신하지 마세요.
ru_ru: Это автоматическое сообщение. Пожалуйста, не отвечайте.
zh_cn: 此邮件由系统自动发送，请勿回复。
zh_tw: 此郵件由系統自動發送，請勿回覆。

# Common_Copyright
source: Â© 2025 Takt Digital Factory (TDF)
ar_sa: © 2025 Takt Digital Factory (TDF)
fr_fr: © 2025 Takt Digital Factory (TDF)
ja_jp: © 2025 Takt Digital Factory (TDF)
ko_kr: © 2025 Takt Digital Factory (TDF)
ru_ru: © 2025 Takt Digital Factory (TDF)
zh_cn: © 2025 节拍数字工厂 · Takt Digital Factory (TDF)
zh_tw: © 2025 節拍數字工廠 · Takt Digital Factory (TDF)

# Common_SecurityTip
source: [Security Notice]
ar_sa: [إشعار أمني]
fr_fr: [Avis de sécurité]
ja_jp: 【セキュリティのお知らせ】
ko_kr: 【보안 안내】
ru_ru: [Уведомление по безопасности]
zh_cn: 【安全提示】
zh_tw: 【安全提示】

# Common_SecurityTip1
source: Please log in and change your password as soon as possible.
ar_sa: يرجى تسجيل الدخول وتغيير كلمة المرور في أقرب وقت ممكن.
fr_fr: Veuillez vous connecter et modifier votre mot de passe dès que possible.
ja_jp: できるだけ早くログインし、パスワードを変更してください。
ko_kr: 가능한 빨리 로그인하여 비밀번호를 변경하세요.
ru_ru: Войдите в систему и смените пароль как можно скорее.
zh_cn: 请尽快登录系统并修改密码
zh_tw: 請盡快登入系統並修改密碼

# Common_SecurityTip2
source: Use a strong password (letters, numbers, and special characters).
ar_sa: استخدم كلمة مرور قوية (حروف وأرقام ورموز خاصة).
fr_fr: Utilisez un mot de passe fort (lettres, chiffres et caractères spéciaux).
ja_jp: 強力なパスワード（英字、数字、特殊文字を含む）をご使用ください。
ko_kr: 강력한 비밀번호(영문, 숫자, 특수문자 포함)를 사용하세요.
ru_ru: Используйте надёжный пароль (буквы, цифры и специальные символы).
zh_cn: 建议使用强密码（包含字母、数字和特殊字符）
zh_tw: 建議使用強密碼（包含字母、數字和特殊字元）

# Common_SecurityTip3
source: Do not share your password with others.
ar_sa: لا تشارك كلمة المرور مع الآخرين.
fr_fr: Ne partagez pas votre mot de passe avec d'autres.
ja_jp: パスワードを他人に教えないでください。
ko_kr: 비밀번호를 타인에게 알려주지 마세요.
ru_ru: Не сообщайте пароль другим лицам.
zh_cn: 不要将密码告知他人
zh_tw: 不要將密碼告知他人

# InitialPassword_Subject
source: Registration Success
ar_sa: نجاح التسجيل
fr_fr: Inscription réussie
ja_jp: ユーザー登録完了のお知らせ
ko_kr: 사용자 등록 완료 안내
ru_ru: Успешная регистрация
zh_cn: 用户注册成功通知
zh_tw: 使用者註冊成功通知

# InitialPassword_Title
source: [Registration Success]
ar_sa: [نجاح التسجيل]
fr_fr: [Inscription réussie]
ja_jp: 【ユーザー登録完了のお知らせ】
ko_kr: 【사용자 등록 완료 안내】
ru_ru: [Успешная регистрация]
zh_cn: 【用户注册成功通知】
zh_tw: 【使用者註冊成功通知】

# InitialPassword_UserSuffix
source: user
ar_sa: مستخدم
fr_fr: utilisateur
ja_jp: ユーザー
ko_kr: 사용자
ru_ru: пользователь
zh_cn: 用户
zh_tw: 使用者

# InitialPassword_MsgRegSuccess
source: You have registered successfully. An initial password has been generated for you.
ar_sa: لقد سجلت بنجاح. تم إنشاء كلمة مرور أولية لك.
fr_fr: Vous vous êtes inscrit avec succès. Un mot de passe initial a été généré pour vous.
ja_jp: 登録が完了しました。初期パスワードが発行されています。
ko_kr: 등록이 완료되었습니다. 초기 비밀번호가 발급되었습니다.
ru_ru: Вы успешно зарегистрированы. Для вас сгенерирован начальный пароль.
zh_cn: 您已注册成功，系统已为您生成初始密码。
zh_tw: 您已註冊成功，系統已為您產生初始密碼。

# InitialPassword_LabelPassword
source: [Initial Password]
ar_sa: [كلمة المرور الأولية]
fr_fr: [Mot de passe initial]
ja_jp: 【初期パスワード】
ko_kr: 【초기 비밀번호】
ru_ru: [Начальный пароль]
zh_cn: 【初始密码】
zh_tw: 【初始密碼】

# ForgotPassword_Subject
source: Password Reset
ar_sa: إعادة تعيين كلمة المرور
fr_fr: Réinitialisation du mot de passe
ja_jp: パスワードリセットのお知らせ
ko_kr: 비밀번호 재설정 안내
ru_ru: Сброс пароля
zh_cn: 密码重置通知
zh_tw: 密碼重設通知

# ForgotPassword_Title
source: [Password Reset]
ar_sa: [إعادة تعيين كلمة المرور]
fr_fr: [Réinitialisation du mot de passe]
ja_jp: 【パスワードリセットのお知らせ】
ko_kr: 【비밀번호 재설정 안내】
ru_ru: [Сброс пароля]
zh_cn: 【密码重置通知】
zh_tw: 【密碼重設通知】

# ForgotPassword_MsgResetIntro
source: We received a password reset request for your account {0}. It has been sent to {1}.
ar_sa: تلقينا طلب إعادة تعيين كلمة المرور للحساب {0}. تم الإرسال إلى {1}.
fr_fr: Nous avons reçu une demande de réinitialisation du mot de passe pour le compte {0}. Envoyé à {1}.
ja_jp: アカウント {0} のパスワード再設定リクエストを受け付けました。 {1} に送信しました。
ko_kr: 계정 {0}의 비밀번호 재설정 요청을 받았습니다. {1}(으)로 발송했습니다.
ru_ru: Мы получили запрос на сброс пароля для учётной записи {0}. Отправлено на {1}.
zh_cn: 我们收到了您的账户 {0} 的密码重置请求。 现已通过 {1} 邮件发出。
zh_tw: 我們收到了您的帳戶 {0} 的密碼重設請求。 現已透過 {1} 郵件發出。

# ForgotPassword_LabelNewPassword
source: [New Password]
ar_sa: [كلمة المرور الجديدة]
fr_fr: [Nouveau mot de passe]
ja_jp: 【新しいパスワード】
ko_kr: 【새 비밀번호】
ru_ru: [Новый пароль]
zh_cn: 【新密码】
zh_tw: 【新密碼】

# ForgotPassword_MsgNotYou
source: If this was not you, please contact the system administrator immediately.
ar_sa: إذا لم تكن أنت، يرجى الاتصال بمسؤول النظام فوراً.
fr_fr: Si ce n'était pas vous, veuillez contacter l'administrateur système immédiatement.
ja_jp: 心当たりがない場合は、至急システム管理者にお問い合わせください。
ko_kr: 본인이 아닌 경우 즉시 시스템 관리자에게 연락하세요.
ru_ru: Если это были не вы, немедленно свяжитесь с системным администратором.
zh_cn: 如果这不是您本人操作，请立即联系系统管理员。
zh_tw: 若這不是您本人的操作，請立即聯絡系統管理員。

# ProcessNotify_LabelProcessName
source: [Process]
ar_sa: [العملية]
fr_fr: [Processus]
ja_jp: 【プロセス名】
ko_kr: 【프로세스명】
ru_ru: [Процесс]
zh_cn: 【流程名称】
zh_tw: 【流程名稱】

# ProcessNotify_LabelApplicant
source: [Applicant]
ar_sa: [مقدم الطلب]
fr_fr: [Demandeur]
ja_jp: 【申請者】
ko_kr: 【신청자】
ru_ru: [Заявитель]
zh_cn: 【申请人】
zh_tw: 【申請人】

# ProcessNotify_LabelApplyTime
source: [Apply Time]
ar_sa: [وقت التقديم]
fr_fr: [Date de demande]
ja_jp: 【申請日時】
ko_kr: 【신청 일시】
ru_ru: [Время подачи]
zh_cn: 【申请时间】
zh_tw: 【申請時間】

# ProcessNotify_LabelCurrentNode
source: [Current Node]
ar_sa: [العقدة الحالية]
fr_fr: [Nœud actuel]
ja_jp: 【現在のノード】
ko_kr: 【현재 노드】
ru_ru: [Текущий узел]
zh_cn: 【当前节点】
zh_tw: 【目前節點】

# ProcessNotify_LabelActionHint
source: [Action]
ar_sa: [الإجراء]
ja_jp: 【操作ヒント】
ko_kr: 【작업 안내】
ru_ru: [Действие]
zh_cn: 【操作提示】
zh_tw: 【操作提示】
